---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures
source: html/8deedf43-bf13-78c4-d884-b49b1c4dd41e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures

Failures occurred when reading key based tree text file.

## Syntax (C#)
```csharp
public static class KeyBasedTreeFileFailures
```